[
    {
        "name": "Easify",
        "githubLink": "https://github.com/MLH-Fellowship/pod-3.1.0-easify",
        "techstacks": "HTML, CSS, JavaScript, NodeJS, CoachkroachDB, YouTube API, MorphCast SDK",
        "description": [
            "Eaisfy is a Chrome Extension to track and enhance developer productivity.",
            "Features include – Emotion Detection, emotion-based music powered by YouTube API and CockroachDB, attention tracker graph, pose estimation, frequent break reminders, and a website blocker to block distractive websites",
            "Classification is done in the browser that ensures the security of user's data", 
            "Easify is capable of working in the background thus have an uptime of 24/7."
        ],
        "id": 4
    },
    {
        "name": "Infinity-Skncure",
        "githubLink": "https://github.com/ishubham21/infinity-skncure-angular",
        "techstacks": "Angular, Typescript, JavaScript, Firebase, Google Cloud Platform (Google APIs), ML5, p5",
        "description": [
            "Infinity Skncure is one of the top 50 global projects selected by Google under the Google Solution Challenge 2021.",
            "It is web-based(PWA) skin disease predictor that can predict over 10 skin diseases and can even suggest skin doctors in the proximity.",
            "Features include – Disease detection using images, real-time disease detection, appointment scheduling, skin health tracker, nearby dermatologists on an in-app Google Map, and a community section to post pictures and text in both public and private mode."
        ],
        "id": 4
    },
    {
        "name": "Summarizer Command-Line Tool",
        "githubLink": "https://github.com/ishubham21/summarizer-cli-tool",
        "techstacks": "NodeJS, JavaScript, MonkeyLearn API",
        "description": [
            "It is an interactive command-line interface tool to help you summarize exhaustive texts into smaller ones using text-analysis and Natural Language Processing.",
            "Users can simply locate the file containing the text that is to be summarized from the command line and print the result anywhere in their machines."
        ],
        "id": 4
    },
    {
        "name": "Voice Enabled Code Compiler",
        "githubLink": "https://ishubham21.github.io/voice-enabled-online-code-editor/",
        "techstacks": "NodeJS, JavaScript, MonkeyLearn API",
        "description": [
            "Developed an interactive online HTML, CSS and JavaScript code compiler with voice recognition to help visually impaired people in learning web technologies."
        ],
        "id": 4
    },
    {
        "name": "Event Registration System",
        "githubLink": "https://techknightsrtu.github.io/online-events/",
        "techstacks": "Firebase, Firestore, JavaScript, CSS, HTML",
        "description": [
            "This website is aimed to reduce the dependency of the college club on third-party resources to book tickets for the events. This project makes use of  Google's Firebase to server backend as a service.",
            "We've enabled this project to create dynamic events along with dynamic forms, and store the data of participants safely that can be retained in the form of .xls(excel) file."
        ],
        "id": 4
    },
    {
        "name": "Technical Blog",
        "githubLink": "https://github.com/ishubham21/techblog/",
        "techstacks": "RSS2JSON, Medium API, JavaScript, CSS, HTML",
        "description": [
            "This website automatically picks up the content from my medium profile in the form of RSS feed, converts it into JSON and present it to the user."
        ],
        "id": 4
    },
    {
        "name": "Cowin Availability",
        "githubLink": "https://github.com/ishubham21/cowin-availability",
        "techstacks": "Node, Express, EJS, CoWin API",
        "description": [
            "A website built using Node, Express, and EJS, that shows the availability of the COVID-19 vaccine based on the user's area code."
        ],
        "id": 4
    },
    {
        "name": "YouTube Scrapper",
        "githubLink": "https://github.com/ishubham21/node-youtube-scraper",
        "techstacks": "NodeJS, JavaScript",
        "description": [
            "It is a node-based command-line scrapper application to download videos, audios and/or subtitles from YouTube.",
            "To download any audio/video, users only have to pass the respective YouTube link in the command line."
        ],
        "id": 4
    },
    {
        "name": "Avengers VS Code Extension",
        "githubLink": "https://marketplace.visualstudio.com/items?itemName=ShubhamGautam.avengers-theme",
        "techstacks": "JavaScript, JSON, Markdown",
        "description": [
            "This extension comes packed with 6 VS Code themes inspried by the colors of Marvel superheroes. It is a one-strop solution to save the user form downloading various scattered themes available on VSCode Marketplace.",
            "This extension has crossed over 1350 installations on VS Code."
        ],
        "id": 4
    },
    {
        "name": "Simply Sway",
        "githubLink": "https://github.com/Simpli-Sway/Restaurant-Software",
        "techstacks": "Django, Python, SQLite, JavaScript, Jinja",
        "description": [
            "It is a Django-based restaurant utility system aimed to make cafes more efficient by replacing conventional waiter-customer model by smart devices."
        ],
        "id": 4
    },
    {
        "name": "Twistopen Clone",
        "githubLink": "https://github.com/ishubham21/twistopen",
        "techstacks": "JavaScript, CSS, HTML",
        "description": [
            "This website is a clone of the Twistopen website (https://twistopen.in)",
            "It took me 2 regular days to complete this website."
        ],
        "id": 4
    }
]